# 1) У вас є змінна величина, тип - int. Напишіть тернарний оператор для змінної new_value за таким правилом: якщо
# значення менше 100, то new_value дорівнює половині значення, у протилежному випадку - протиположне
# значенню число

value = 150
result = value/2 if value < 100 else -value
print(result)

####################################################
# 2) У вас є змінна величина, тип - int. Написати тернарний оператор для змінної new_value за таким правилом: якщо
# значення менше 100, то new_value дорівнює 1, у протилежному випадку - 0

value = 100
result = value/value if value < 100 else value-value
print(result)

####################################################
# 3) У вас є змінна величина, тип - int. Напишіть тернарний оператор для змінного new_value за таким правилом: якщо
# значення менше 100, то new_value дорівнює True, у протилежному випадку - False

value = 4
result = True if value < 100 else False
print(result)

####################################################
# 4) У вас є змінна my_str, тип - str. Якщо її довше менше 5, то допишіть в кінці строки її ж.
# Приклад: було - "qwer", стало - "qwerqwer". Якщо довжина не менше 5, то залишити строку як є.

value = "qwerty"
index = 5
if len(value) < 5:
    print(value+value)
else:
    print(value)

####################################################
# 5) У вас є змінна my_str, тип - str. Якщо її довжина менше 5, то допишіть в кінці рядка перевернуту її ж.
#    Приклад: було - "qwer", стало - "qwerrewq". Якщо довжина не менше 5, то залишити строку як є.

value = "qwe"
index = 5
if len(value) < 5:
    print(value[::-1])
else:
    print(value)